Revit 2027 API
BuiltInFailures.FluidFailures Class
 Failures about Fluid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FluidFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FluidFailures
Public NotInheritable Class FluidFailures
public ref class FluidFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FluidFailures = class end
The BuiltInFailures.FluidFailures type exposes the following members.
Properties
Name | Description
UndefinedFluidType |  The fluid type '[Type Name]' is not defined
Top
See Also
Reference
Autodesk.Revit.DB Namespace